/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Nie można było ukończyć tej czynności.";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Wystąpił nieznany błąd (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Nie można ukończyć czynności";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Spróbuj ponownie później.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Nie można nagrać";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Spróbuj nagrać ponownie.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Nie można nagrać";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Zatrzymaj pozostałe czynności używające urządzenia (%@) i spróbuj ponownie."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Nie można nagrać";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Spróbuj nagrać ponownie.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Spróbuj nagrać ponownie.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operacja zatrzymana";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Jest za mało miejsca, aby kontynuować zapisywanie w pliku. Zwolnij miejsce, usuwając wideo lub zdjęcia.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Spróbuj nagrać ponownie.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Spróbuj nagrać ponownie.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Maksymalny czas tego nagrania został osiągnięty."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Maksymalna wielkość tego nagrania została osiągnięta."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Zatrzymaj pozostałe czynności używające urządzenia nagrywającego i spróbuj ponownie.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Maksymalny czas tego nagrania został osiągnięty."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Nie można nagrać";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Spróbuj nagrać ponownie.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Nie można użyć (%@)"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Zatrzymaj pozostałe czynności używające urządzenia (%@) i spróbuj ponownie."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Nie można użyć (%@)"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Zatrzymaj pozostałe czynności używające urządzenia (%@) i spróbuj ponownie."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Nagrywanie zatrzymane";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Zatrzymaj pozostałe czynności używające urządzenia nagrywającego i spróbuj ponownie.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Nie można ukończyć czynności";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Spróbuj ponownie później.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Nie można ukończyć eksportu";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Spróbuj wyeksportować ponownie.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Nie można odkodować";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Nie można było odkodować danych multimedium. Może być ono uszkodzone.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Ten format multimediów nie jest obsługiwany.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Nie można zachować";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Spróbuj zachować ponownie.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Tego pliku multimediów nie można użyć.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Tego pliku multimediów nie można użyć.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Tego pliku multimediów nie można użyć.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Tego pliku multimediów nie można użyć.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Ten format multimediów nie jest obsługiwany.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Ten plik multimediów może być uszkodzony.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Nie można zrobić zdjęcia";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Spróbuj zrobić zdjęcie ponownie.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operacja zatrzymana";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Operacja nie jest obsługiwana dla zawartości chronionej."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Brak autoryzacji dla zawartości."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Ten program nie ma autoryzacji do odtwarzania tego pliku."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Tego pliku multimediów nie można użyć.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Nie można odkodować";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Nie można znaleźć dekodera wymaganego dla tych multimediów.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Nie można zakodować";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Nie można znaleźć kodera wymaganego dla tych multimediów.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Nie można odkodować";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Dekoder wymagany dla tych multimediów jest zajęty.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Zatrzymaj pozostałe czynności odkodowujące multimedia i spróbuj ponownie.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Nie można zakodować";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Koder wymagany dla tych multimediów jest zajęty.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Zatrzymaj pozostałe czynności kodujące multimedia i spróbuj ponownie.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Nie można użyć (%@)"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Programy działające w tle nie mogą używać tego urządzenia (%@)."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operacja zatrzymana";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Operacja nie jest obsługiwana dla tego multimedium.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operacja zatrzymana";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Nie można było skomponować wideo zgodnie z podanymi instrukcjami.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Nie można otworzyć";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Tego pliku multimediów nie można użyć.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operacja zatrzymana";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Nie można użyć pliku buforu pod adresem URL pobierania.";
